# Formulae
brew "bat"
brew "btop"
brew "bun"
brew "dust"
brew "eza"
brew "fastfetch"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "git-filter-repo"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "uv"
brew "yt-dlp"
brew "zellij"

# Casks
cask "1password"
cask "1password-cli"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
